Ejercicio7/MVCconIA/fitnessclub/pruebas/jmeter/reporte-carga/statistics.json
{
  "02 POST /login-0" : {
    "transaction" : "02 POST /login-0",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 72.7,
    "medianResTime" : 71.5,
    "minResTime" : 64.0,
    "maxResTime" : 116.0,
    "pct1ResTime" : 81.9,
    "pct2ResTime" : 92.99999999999991,
    "pct3ResTime" : 116.0,
    "throughput" : 0.8536064874093043,
    "receivedKBytesPerSec" : 0.3376080345710627,
    "sentKBytesPerSec" : 0.3367744344857021
  },
  "03 GET /panel (tablero)" : {
    "transaction" : "03 GET /panel (tablero)",
    "sampleCount" : 2875,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.153739130434792,
    "medianResTime" : 5.0,
    "minResTime" : 3.0,
    "maxResTime" : 78.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 11.199999999999818,
    "pct3ResTime" : 25.23999999999978,
    "throughput" : 9.665912445324555,
    "receivedKBytesPerSec" : 73.33012300714101,
    "sentKBytesPerSec" : 1.6424499662953835
  },
  "05 POST /accesos/entrada" : {
    "transaction" : "05 POST /accesos/entrada",
    "sampleCount" : 2860,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 32.955594405594425,
    "medianResTime" : 32.0,
    "minResTime" : 14.0,
    "maxResTime" : 114.0,
    "pct1ResTime" : 40.0,
    "pct2ResTime" : 45.0,
    "pct3ResTime" : 72.0,
    "throughput" : 9.665884834023913,
    "receivedKBytesPerSec" : 727.5403100771919,
    "sentKBytesPerSec" : 5.295470109265055
  },
  "02 POST /login" : {
    "transaction" : "02 POST /login",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 78.32,
    "medianResTime" : 76.5,
    "minResTime" : 68.0,
    "maxResTime" : 124.0,
    "pct1ResTime" : 87.9,
    "pct2ResTime" : 97.99999999999991,
    "pct3ResTime" : 124.0,
    "throughput" : 0.8535336292249915,
    "receivedKBytesPerSec" : 6.8121485842010925,
    "sentKBytesPerSec" : 0.48177972430863775
  },
  "08 GET /personas (listado)" : {
    "transaction" : "08 GET /personas (listado)",
    "sampleCount" : 2835,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 82.63915343915343,
    "medianResTime" : 82.0,
    "minResTime" : 57.0,
    "maxResTime" : 166.0,
    "pct1ResTime" : 96.0,
    "pct2ResTime" : 100.0,
    "pct3ResTime" : 111.0,
    "throughput" : 9.667354350309457,
    "receivedKBytesPerSec" : 2920.5509836522397,
    "sentKBytesPerSec" : 1.6710173046921621
  },
  "05 POST /accesos/entrada-1" : {
    "transaction" : "05 POST /accesos/entrada-1",
    "sampleCount" : 2860,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 26.49615384615384,
    "medianResTime" : 27.0,
    "minResTime" : 6.0,
    "maxResTime" : 71.0,
    "pct1ResTime" : 34.0,
    "pct2ResTime" : 36.0,
    "pct3ResTime" : 44.0,
    "throughput" : 9.667976012602173,
    "receivedKBytesPerSec" : 724.3271370748288,
    "sentKBytesPerSec" : 1.6616833771659985
  },
  "05 POST /accesos/entrada-0" : {
    "transaction" : "05 POST /accesos/entrada-0",
    "sampleCount" : 2860,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.412937062937065,
    "medianResTime" : 5.0,
    "minResTime" : 4.0,
    "maxResTime" : 84.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 14.0,
    "pct3ResTime" : 41.0,
    "throughput" : 9.666930310220582,
    "receivedKBytesPerSec" : 3.3702091022936993,
    "sentKBytesPerSec" : 3.634539227963793
  },
  "07 POST /accesos/salida-0" : {
    "transaction" : "07 POST /accesos/salida-0",
    "sampleCount" : 2842,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.834271639690366,
    "medianResTime" : 4.0,
    "minResTime" : 3.0,
    "maxResTime" : 83.0,
    "pct1ResTime" : 8.0,
    "pct2ResTime" : 12.0,
    "pct3ResTime" : 41.570000000000164,
    "throughput" : 9.664497085688247,
    "receivedKBytesPerSec" : 3.369168188433889,
    "sentKBytesPerSec" : 3.624186407133093
  },
  "06 GET /accesos (refresca token)" : {
    "transaction" : "06 GET /accesos (refresca token)",
    "sampleCount" : 2855,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 27.21751313485112,
    "medianResTime" : 27.0,
    "minResTime" : 7.0,
    "maxResTime" : 108.0,
    "pct1ResTime" : 34.0,
    "pct2ResTime" : 37.0,
    "pct3ResTime" : 56.0,
    "throughput" : 9.680164647564023,
    "receivedKBytesPerSec" : 711.5520264877955,
    "sentKBytesPerSec" : 1.6637782988000664
  },
  "07 POST /accesos/salida-1" : {
    "transaction" : "07 POST /accesos/salida-1",
    "sampleCount" : 2842,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 26.545038705137266,
    "medianResTime" : 27.0,
    "minResTime" : 6.0,
    "maxResTime" : 68.0,
    "pct1ResTime" : 34.0,
    "pct2ResTime" : 36.0,
    "pct3ResTime" : 45.0,
    "throughput" : 9.664267035736025,
    "receivedKBytesPerSec" : 712.4102987661653,
    "sentKBytesPerSec" : 1.6610458967671293
  },
  "07 POST /accesos/salida" : {
    "transaction" : "07 POST /accesos/salida",
    "sampleCount" : 2842,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 32.428219563687556,
    "medianResTime" : 32.0,
    "minResTime" : 12.0,
    "maxResTime" : 117.0,
    "pct1ResTime" : 39.0,
    "pct2ResTime" : 43.0,
    "pct3ResTime" : 70.57000000000016,
    "throughput" : 9.663445518160612,
    "receivedKBytesPerSec" : 715.7185414438809,
    "sentKBytesPerSec" : 5.2846967677440855
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 28736,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 27.400090478842042,
    "medianResTime" : 28.0,
    "minResTime" : 1.0,
    "maxResTime" : 166.0,
    "pct1ResTime" : 66.0,
    "pct2ResTime" : 83.0,
    "pct3ResTime" : 96.0,
    "throughput" : 96.0999525118553,
    "receivedKBytesPerSec" : 7182.431944937371,
    "sentKBytesPerSec" : 27.64407476184863
  },
  "04 GET /accesos (recepción)" : {
    "transaction" : "04 GET /accesos (recepción)",
    "sampleCount" : 2865,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 26.91937172774872,
    "medianResTime" : 27.0,
    "minResTime" : 6.0,
    "maxResTime" : 103.0,
    "pct1ResTime" : 34.0,
    "pct2ResTime" : 37.0,
    "pct3ResTime" : 54.340000000000146,
    "throughput" : 9.657194862979068,
    "receivedKBytesPerSec" : 696.9676692537162,
    "sentKBytesPerSec" : 1.6598303670745271
  },
  "02 POST /login-1" : {
    "transaction" : "02 POST /login-1",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.5,
    "medianResTime" : 5.0,
    "minResTime" : 4.0,
    "maxResTime" : 9.0,
    "pct1ResTime" : 7.899999999999999,
    "pct2ResTime" : 9.0,
    "pct3ResTime" : 9.0,
    "throughput" : 0.854642417612471,
    "receivedKBytesPerSec" : 6.482980196866881,
    "sentKBytesPerSec" : 0.1452224420552441
  },
  "01 GET /login" : {
    "transaction" : "01 GET /login",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.6599999999999993,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 30.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 12.249999999999979,
    "pct3ResTime" : 30.0,
    "throughput" : 0.8531404098486529,
    "receivedKBytesPerSec" : 8.18065008232805,
    "sentKBytesPerSec" : 0.10081053671063184
  }
}