Ejercicio7/MVCconIA/fitnessclub/pruebas/jmeter/reporte-stress-200/statistics.json
{
  "02 POST /login-0" : {
    "transaction" : "02 POST /login-0",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 77.10499999999995,
    "medianResTime" : 76.0,
    "minResTime" : 64.0,
    "maxResTime" : 108.0,
    "pct1ResTime" : 83.9,
    "pct2ResTime" : 91.84999999999997,
    "pct3ResTime" : 101.0,
    "throughput" : 6.654688227856525,
    "receivedKBytesPerSec" : 2.6319811838690357,
    "sentKBytesPerSec" : 2.62548246489652
  },
  "03 GET /panel (tablero)" : {
    "transaction" : "03 GET /panel (tablero)",
    "sampleCount" : 3643,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 424.8331045841339,
    "medianResTime" : 206.0,
    "minResTime" : 4.0,
    "maxResTime" : 4962.0,
    "pct1ResTime" : 1206.1999999999994,
    "pct2ResTime" : 1756.3999999999978,
    "pct3ResTime" : 3160.24,
    "throughput" : 20.424754151669077,
    "receivedKBytesPerSec" : 154.98122213356825,
    "sentKBytesPerSec" : 3.470612521865644
  },
  "05 POST /accesos/entrada" : {
    "transaction" : "05 POST /accesos/entrada",
    "sampleCount" : 3583,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1102.7289980463313,
    "medianResTime" : 737.0,
    "minResTime" : 29.0,
    "maxResTime" : 8055.0,
    "pct1ResTime" : 2784.0,
    "pct2ResTime" : 3507.599999999998,
    "pct3ResTime" : 5245.399999999994,
    "throughput" : 20.1892140124302,
    "receivedKBytesPerSec" : 2790.7810466217015,
    "sentKBytesPerSec" : 11.06069244235678
  },
  "02 POST /login" : {
    "transaction" : "02 POST /login",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 84.895,
    "medianResTime" : 83.0,
    "minResTime" : 69.0,
    "maxResTime" : 125.0,
    "pct1ResTime" : 97.0,
    "pct2ResTime" : 106.84999999999997,
    "pct3ResTime" : 123.93000000000006,
    "throughput" : 6.652917304237909,
    "receivedKBytesPerSec" : 53.112889611469626,
    "sentKBytesPerSec" : 3.755259962743663
  },
  "08 GET /personas (listado)" : {
    "transaction" : "08 GET /personas (listado)",
    "sampleCount" : 3449,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 517.4868077703679,
    "medianResTime" : 325.0,
    "minResTime" : 61.0,
    "maxResTime" : 5524.0,
    "pct1ResTime" : 1123.0,
    "pct2ResTime" : 1661.5,
    "pct3ResTime" : 3557.0,
    "throughput" : 19.759268064920853,
    "receivedKBytesPerSec" : 5969.363644749601,
    "sentKBytesPerSec" : 3.4154203588779213
  },
  "05 POST /accesos/entrada-1" : {
    "transaction" : "05 POST /accesos/entrada-1",
    "sampleCount" : 3583,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 657.6000558191453,
    "medianResTime" : 448.0,
    "minResTime" : 24.0,
    "maxResTime" : 6729.0,
    "pct1ResTime" : 1596.1999999999998,
    "pct2ResTime" : 2249.799999999997,
    "pct3ResTime" : 3800.399999999998,
    "throughput" : 20.194789823133544,
    "receivedKBytesPerSec" : 2784.5112317402154,
    "sentKBytesPerSec" : 3.470979500851078
  },
  "05 POST /accesos/entrada-0" : {
    "transaction" : "05 POST /accesos/entrada-0",
    "sampleCount" : 3583,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 445.05191180574974,
    "medianResTime" : 224.0,
    "minResTime" : 3.0,
    "maxResTime" : 4975.0,
    "pct1ResTime" : 1225.3999999999996,
    "pct2ResTime" : 1765.199999999999,
    "pct3ResTime" : 3240.0399999999972,
    "throughput" : 20.22374243655739,
    "receivedKBytesPerSec" : 7.050660204932606,
    "sentKBytesPerSec" : 7.603653162182222
  },
  "07 POST /accesos/salida-0" : {
    "transaction" : "07 POST /accesos/salida-0",
    "sampleCount" : 3502,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 445.7692747001715,
    "medianResTime" : 231.0,
    "minResTime" : 3.0,
    "maxResTime" : 4991.0,
    "pct1ResTime" : 1157.2000000000016,
    "pct2ResTime" : 1764.0999999999995,
    "pct3ResTime" : 3193.879999999999,
    "throughput" : 19.90394725624485,
    "receivedKBytesPerSec" : 6.9391691117963,
    "sentKBytesPerSec" : 7.463980221091819
  },
  "06 GET /accesos (refresca token)" : {
    "transaction" : "06 GET /accesos (refresca token)",
    "sampleCount" : 3530,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 839.0790368271943,
    "medianResTime" : 496.5,
    "minResTime" : 23.0,
    "maxResTime" : 7070.0,
    "pct1ResTime" : 2243.7000000000003,
    "pct2ResTime" : 2939.4999999999945,
    "pct3ResTime" : 5032.0,
    "throughput" : 19.972728455762955,
    "receivedKBytesPerSec" : 2723.3223409802335,
    "sentKBytesPerSec" : 3.4328127033342573
  },
  "07 POST /accesos/salida-1" : {
    "transaction" : "07 POST /accesos/salida-1",
    "sampleCount" : 3502,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 653.3986293546544,
    "medianResTime" : 463.0,
    "minResTime" : 25.0,
    "maxResTime" : 5984.0,
    "pct1ResTime" : 1581.800000000001,
    "pct2ResTime" : 2190.5499999999997,
    "pct3ResTime" : 3866.0399999999936,
    "throughput" : 19.89264108608594,
    "receivedKBytesPerSec" : 2698.849021423855,
    "sentKBytesPerSec" : 3.4190476866710218
  },
  "07 POST /accesos/salida" : {
    "transaction" : "07 POST /accesos/salida",
    "sampleCount" : 3502,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1099.242147344375,
    "medianResTime" : 758.0,
    "minResTime" : 30.0,
    "maxResTime" : 7923.0,
    "pct1ResTime" : 2749.100000000001,
    "pct2ResTime" : 3865.85,
    "pct3ResTime" : 5027.969999999999,
    "throughput" : 19.89196312432193,
    "receivedKBytesPerSec" : 2705.692032910563,
    "sentKBytesPerSec" : 10.878417333613555
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 36276,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 679.2989304223187,
    "medianResTime" : 824.0,
    "minResTime" : 1.0,
    "maxResTime" : 8055.0,
    "pct1ResTime" : 2562.9000000000015,
    "pct2ResTime" : 3224.0,
    "pct3ResTime" : 4971.0,
    "throughput" : 201.03298457173258,
    "receivedKBytesPerSec" : 22051.827117005312,
    "sentKBytesPerSec" : 57.8899082509227
  },
  "04 GET /accesos (recepción)" : {
    "transaction" : "04 GET /accesos (recepción)",
    "sampleCount" : 3599,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 753.7357599333152,
    "medianResTime" : 463.0,
    "minResTime" : 23.0,
    "maxResTime" : 6862.0,
    "pct1ResTime" : 1956.0,
    "pct2ResTime" : 2780.0,
    "pct3ResTime" : 4982.0,
    "throughput" : 20.235812721742114,
    "receivedKBytesPerSec" : 2698.453870392613,
    "sentKBytesPerSec" : 3.4780303115494253
  },
  "02 POST /login-1" : {
    "transaction" : "02 POST /login-1",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.66,
    "medianResTime" : 6.5,
    "minResTime" : 4.0,
    "maxResTime" : 42.0,
    "pct1ResTime" : 9.800000000000011,
    "pct2ResTime" : 17.94999999999999,
    "pct3ResTime" : 38.91000000000008,
    "throughput" : 6.6771274997496075,
    "receivedKBytesPerSec" : 50.66531315727974,
    "sentKBytesPerSec" : 1.1345900243715155
  },
  "01 GET /login" : {
    "transaction" : "01 GET /login",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.4050000000000007,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 22.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 5.990000000000009,
    "throughput" : 6.715465717547512,
    "receivedKBytesPerSec" : 64.39370886777247,
    "sentKBytesPerSec" : 0.7935267107648916
  }
}